VatEngine/src/test/resources/BH_test11_Cultural.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <AnalyseDocument xmlns="http://tempuri.org/">
      <document><![CDATA[<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/xsl" href="http://www.vatat.com/xml/vatat_invoice_view_jscript.xsl"?>
<iVATEngineInput>
<IncludeReportingIndicationInResponse>True</IncludeReportingIndicationInResponse>
	<Supplier>
		<ID>21535</ID>
		<Name>BECOMPANY NV</Name>
		<Address>TOEKOMSTSTRAAT 10</Address>
		<ZIP>2000</ZIP>
		<City>ANTWERPEN</City>
		<Country>BE</Country>
		<RegOfCommerce/>
		<BancAccountNumber/>
		<IBAN/>
		<BIC/>
		<TelephoneNumber/>
		<FaxNumber/>
		<EmailAddress/>
		<SpecialType>0</SpecialType>
		<DeductionType>0</DeductionType>
		<VATNumberSupplier Country="BE">
			<VATNumber>BE0686731303</VATNumber>
			<VATNumberType>1</VATNumberType>
			<Name/>
			<Address1/>
			<Address2/>
			<Address3/>
			<TaxNumber/>
			<BelongsToFiscalUnit>0</BelongsToFiscalUnit>
		</VATNumberSupplier>
		<CountryChosenVATNumber>BE</CountryChosenVATNumber>
	</Supplier>
	<Customer>
		<ID>21535</ID>
		<Name>BECOMPANY NV B</Name>
		<Address>TOEKOMSTSTRAAT 102</Address>
		<ZIP>2000</ZIP>
		<City>ANTWERPEN</City>
		<EmailAddress/>
		<Country>BE</Country>
		<SpecialType>0</SpecialType>
		<VATNumberCustomer Country="BE">
			<VATNumber>BE0686731304</VATNumber>
			<VATNumberType>1</VATNumberType>
			<Name/>
			<Address1/>
			<Address2/>
			<Address3/>
			<RequiredOnInvoicePicture>false</RequiredOnInvoicePicture>
			<BelongsToFiscalUnit>1</BelongsToFiscalUnit>
		</VATNumberCustomer>
		<CountryChosenVATNumber>BE</CountryChosenVATNumber>
	</Customer>
	<InvoiceProperties>
		<DocumentType>0</DocumentType>
		<Disconto>0</Disconto>
		<Currency1>EUR</Currency1>
		<InvoiceNumber/>
		<ReferenceInvoiceNumber/>
		<InvoiceDate>2019-01-01</InvoiceDate>
		<OfficialLanguage>1</OfficialLanguage>
	</InvoiceProperties>
	<Item ID="1">
		<Properties>
			<Description/>
			<InternationalDescription LanguageID="3">Cultural, Artistic, Sports and Recreational Services</InternationalDescription>
			<TaricCode/>
			<CPCCode/>
			<Amounts CurrencyNumber="1">
				<UnitPriceExclVAT>1000</UnitPriceExclVAT>
				<TotalAmountExclVAT>1000</TotalAmountExclVAT>
				<PackagingCosts>0</PackagingCosts>
			</Amounts>
			<Number>1</Number>
			<Unit/>
			<VATRate>5</VATRate>
			<Reduction>0</Reduction>
			<AdditionalProperties>
				<PropertiesPerCountry Country="BE">
					<VATRateCode>S</VATRateCode>
				</PropertiesPerCountry>
				<PropertiesPerCountry Country="BH">
					<VATRateCode>S</VATRateCode>
				</PropertiesPerCountry>
				<EngineParameter1/>
				<EngineParameter2>N</EngineParameter2>
				<EngineParameter3/>
			</AdditionalProperties>
			<ItemClassificationCode>278</ItemClassificationCode>
			<OutOfVAT>0</OutOfVAT>
		</Properties>
		<Conditions>
			<CountryOperation>BH</CountryOperation>
			<ContinuousSupply>0</ContinuousSupply>
			<DateTransaction>2019-01-01</DateTransaction>
		</Conditions>
		<Mentioning Country="BE">
			<Number>408</Number>
			<Text>Prestation de services non soumise à la TVA belge art. 21,  § 3, 3°, a CTVA / Article 53 - Directive 2006/112/EC</Text>
		</Mentioning>
		<AdditionalMentioning>
			<Text>De dienst wordt verricht in Bahrein / The service is performed in Bahrain</Text>
		</AdditionalMentioning>
	</Item>
	<AmountsSummary CurrencyNumber="1">
		<VATTotals VATRate="5">
			<AmountDisconto>0</AmountDisconto>
			<AmountExclVAT>1000</AmountExclVAT>
			<AmountVAT>50</AmountVAT>
		</VATTotals>
		<Totals>
			<TotalAmountVAT>50</TotalAmountVAT>
			<TotalAmountInclVAT>1050</TotalAmountInclVAT>
			<TotalAmountDisconto>0</TotalAmountDisconto>
			<TotalAmountInclVATCash>1050</TotalAmountInclVATCash>
			<TotalAmountPackagingCosts>0</TotalAmountPackagingCosts>
		</Totals>
	</AmountsSummary>
	<CheckValue>100</CheckValue>
</iVATEngineInput>]]></document>
    </AnalyseDocument>
  </soap:Body>
</soap:Envelope>